In [ ]:
import pandas as pd

df1 = pd.read_excel("../data/raw/moving-annual-rent-2025.xlsx", sheet_name="1 bedroom flat")
df2 = pd.read_excel("../data/raw/moving-annual-rent-2025.xlsx", sheet_name="2 bedroom flat")
df3 = pd.read_excel("../data/raw/moving-annual-rent-2025.xlsx", sheet_name="3 bedroom flat")
df4 = pd.read_excel("../data/raw/moving-annual-rent-2025.xlsx", sheet_name="2 bedroom house")
df5 = pd.read_excel("../data/raw/moving-annual-rent-2025.xlsx", sheet_name="3 bedroom house")
df6 = pd.read_excel("../data/raw/moving-annual-rent-2025.xlsx", sheet_name="4 bedroom house")

df1.head(10)

In [2]:
import pandas as pd

df = pd.read_csv("../data/processed/historical_and_forecast_data.csv")

list=[]
for col in df.columns:
    if col not in ['index', 'Mar-25'] and not col.startswith('2'):
        list.append(col)

df_cleaned = df.drop(columns=list)

df_cleaned=df_cleaned.rename(columns={'Mar-25': 'Price_today'})

df_cleaned.head()

,index,Price_today,2025Q2,2025Q3,2025Q4,2026Q1,2026Q2,2026Q3,2026Q4,2027Q1,...,2027Q4,2028Q1,2028Q2,2028Q3,2028Q4,2029Q1,2029Q2,2029Q3,2029Q4,2030Q1
0,Albert Park-Middle Park-West St Kilda,700.0,697.421379,699.618152,694.810404,687.826767,685.415159,676.796165,679.935770,666.719495,...,664.976224,653.260323,657.406545,654.029519,663.603091,661.765671,669.900060,673.692795,682.941255,691.922189
1,Armadale,625.0,630.202314,637.680396,648.436551,652.752795,657.069039,661.385283,665.701527,670.017771,...,682.966502,687.282746,691.598990,695.915234,700.231478,704.547722,708.863966,713.180210,717.496454,721.812697
2,Carlton North,720.0,728.365576,735.993061,743.032473,749.603340,755.800894,761.701013,767.364150,772.838472,...,788.474907,793.507344,798.479158,803.402670,808.287699,813.142065,817.972001,822.782473,827.577436,832.360044
3,Carlton-Parkville,600.0,600.652519,601.556790,606.711298,601.026914,599.331589,599.695880,599.391098,599.260358,...,604.205223,608.435110,612.254466,615.899749,619.226922,623.789979,627.751477,631.401827,635.307710,638.824883
4,CBD-St Kilda Rd,650.0,642.940699,633.651440,621.726074,609.185029,596.816713,585.731950,576.569522,569.814935,...,564.710941,567.309664,571.333368,576.250730,581.535788,586.710022,591.373626,595.226278,598.076695,599.842110

In [3]:
df_avg = df_cleaned

df_avg["avg_future"]=df_avg.iloc[:,2:].mean(axis=1)


drop=[]

for col in df_avg.columns:
    if col not in ['index', 'Price_today', 'avg_future']:
        drop.append(col)

df_growth = df_avg.drop(columns=drop)

df_growth.head()

                                   index  Price_today  avg_future
0  Albert Park-Middle Park-West St Kilda        700.0  674.221781
1                               Armadale        625.0  680.006297
2                          Carlton North        720.0  784.110676
3                      Carlton-Parkville        600.0  611.431314
4                        CBD-St Kilda Rd        650.0  589.923889

In [12]:
df_growth['Price_change (%)'] = (df_growth['avg_future'] - df_growth['Price_today'])/df_growth['Price_today']*100

df_sorted = df_growth.sort_values(by='Price_change (%)', ascending=False)

df_sorted.head()

                    index  Price_today  avg_future  Price_change (%)
130               Mildura        450.0  608.481381         35.218085
108  Seaford-Carrum Downs        550.0  726.785359         32.142793
96                Berwick        595.0  748.595230         25.814324
137            Shepparton        450.0  563.057993         25.123998
97             Cranbourne        580.0  715.200258         23.310389

In [15]:
df_prices = pd.read_csv("../data/raw/House_prices.csv", sep=";")


df_sorted['index'] = df_sorted['index'].str.upper()

rental = df_sorted.rename(columns={'index': 'Suburb'})

rental.head()

                   Suburb  Price_today  avg_future  Price_change (%)
130               MILDURA        450.0  608.481381         35.218085
108  SEAFORD-CARRUM DOWNS        550.0  726.785359         32.142793
96                BERWICK        595.0  748.595230         25.814324
137            SHEPPARTON        450.0  563.057993         25.123998
97             CRANBOURNE        580.0  715.200258         23.310389

In [25]:
merged = rental.merge(df_prices, on = 'Suburb', how='left')


total = merged.dropna()

total

,Suburb,Price_today,avg_future,Price_change (%),Q3_2024,Q4_2024,Q1_2025,Num_sales
0,MILDURA,450.0,608.481381,35.218085,455000.0,490000.0,485000.0,165.0
2,BERWICK,595.0,748.595230,25.814324,860000.0,900000.0,900000.0,181.0
3,SHEPPARTON,450.0,563.057993,25.123998,450000.0,470000.0,470500.0,188.0
4,CRANBOURNE,580.0,715.200258,23.310389,647500.0,677000.0,660000.0,109.0
5,PAKENHAM,530.0,652.882722,23.185419,640000.0,660000.0,670000.0,247.0
...,...,...,...,...,...,...,...,...
133,BOX HILL,600.0,597.071559,-0.488073,1810000.0,1550000.0,1725000.0,7.0
139,HAWTHORN,530.0,505.158938,-4.686993,2770000.0,2750000.0,2440000.0,26.0
141,SOUTH YARRA,600.0,568.841531,-5.193078,1595000.0,2597500.0,1590000.0,23.0
142,ST KILDA,550.0,506.552316,-7.899579,1680000.0,1590000.0,1423000.0,6.0
145,CLAYTON,600.0,536.440003,-10.593333,1150000.0,1165000.0,1200000.0,13.0

In [28]:
columns = ['Q3_2024', 'Q4_2024']

total = total.rename(columns={'Q1_2025':'property_price'})

total = total.drop(columns=columns)

total.head()

,Suburb,Price_today,avg_future,Price_change (%),property_price,Num_sales
0,MILDURA,450.0,608.481381,35.218085,485000.0,165.0
2,BERWICK,595.0,748.595230,25.814324,900000.0,181.0
3,SHEPPARTON,450.0,563.057993,25.123998,470500.0,188.0
4,CRANBOURNE,580.0,715.200258,23.310389,660000.0,109.0
5,PAKENHAM,530.0,652.882722,23.185419,670000.0,247.0

In [34]:
total['Annual ROI (%)'] = total['avg_future'] / total['property_price'] * 100 


sorted_roi = total.sort_values(by = 'Annual ROI (%)', ascending=False)

sorted_roi.head(10)

,Suburb,Price_today,avg_future,Price_change (%),property_price,Num_sales,Annual ROI (%)
0,MILDURA,450.0,608.481381,35.218085,485000.0,165.0,0.125460
3,SHEPPARTON,450.0,563.057993,25.123998,470500.0,188.0,0.119672
19,MORWELL,360.0,417.670596,16.019610,351000.0,96.0,0.118994
24,BAIRNSDALE,450.0,517.382069,14.973793,450000.0,35.0,0.114974
22,BENALLA,440.0,508.689169,15.611175,465000.0,55.0,0.109396
4,CRANBOURNE,580.0,715.200258,23.310389,660000.0,109.0,0.108364
46,NORTH BENDIGO,460.0,511.675043,11.233705,497500.0,23.0,0.102849
43,HORSHAM,380.0,423.768112,11.517924,413100.0,68.0,0.102582
33,SEYMOUR,400.0,453.098796,13.274699,443000.0,27.0,0.102280
10,WARRAGUL,520.0,624.066354,20.012760,620000.0,102.0,0.100656

In [37]:
d = total.sort_values(by = 'Num_sales', ascending=False)

d.head(10)

,Suburb,Price_today,avg_future,Price_change (%),property_price,Num_sales,Annual ROI (%)
5,PAKENHAM,530.0,652.882722,23.185419,670000.0,247.0,0.097445
65,SUNBURY,500.0,541.901016,8.380203,677500.0,208.0,0.079985
126,CRAIGIEBURN,520.0,532.896569,2.480109,679000.0,194.0,0.078483
3,SHEPPARTON,450.0,563.057993,25.123998,470500.0,188.0,0.119672
2,BERWICK,595.0,748.595230,25.814324,900000.0,181.0,0.083177
0,MILDURA,450.0,608.481381,35.218085,485000.0,165.0,0.125460
8,FRANKSTON,530.0,638.530038,20.477366,750000.0,146.0,0.085137
18,TRARALGON,440.0,511.638207,16.281411,535000.0,136.0,0.095633
15,WARRNAMBOOL,500.0,589.211864,17.842373,600000.0,122.0,0.098202
4,CRANBOURNE,580.0,715.200258,23.310389,660000.0,109.0,0.108364